<section xmlns="http://www.w3.org/1999/xhtml" data-type="preface" id="preface">
<h1 class="chapterhead">Prefacio</h1>

<p class="lede">p5.js est&#xE1; inspirado y guiado por otro proyecto, que empez&#xF3; hace alrededor de 15 a&#xF1;os. En el a&#xF1;o 2001, Casey Reas y Ben Fry empezaron a trabajar en una nueva plataforma para hacer m&#xE1;s f&#xE1;cil la programaci&#xF3;n de gr&#xE1;ficas interactivas; la nombraron Processing. Ellos estaban frustrados con lo dif&#xED;cil que era escribir este tipo de software con los lenguajes que normalmente usaban (C++ y Java) y fueron inspirados por lo simple que era escribir programas interesantes con los lenguajes de su ni&#xF1;ez (Logo y BASIC). Su mayor influencia fue Design by Numbers (DBN), un lenguaje que ellos en ese tiempo estaban manteniendo y ense&#xF1;ando (y que fue creado por su tutor de investigaci&#xF3;n, John Maeda).</p>

<p>Con Processing, Ben y Casey estaban buscando una mejor manera de probar sus ideas f&#xE1;cilmente y en c&#xF3;digo, en vez de solamente conversar sobre ellas o pasar demasiado tiempo program&#xE1;ndolas en C++. Su otro objetivo fue construir un lenguaje para ense&#xF1;ar programaci&#xF3;n a estudiantes de dise&#xF1;o y de arte y ofrecerle a estudiantes m&#xE1;s avanzados una manera m&#xE1;s f&#xE1;cil de trabajar con gr&#xE1;ficas. Esta combinaci&#xF3;n es una desviaci&#xF3;n positiva de la manera en que usualmente se ense&#xF1;a programaci&#xF3;n. Los nuevos usuarios empiezan concentr&#xE1;ndose en gr&#xE1;ficos e interacci&#xF3;n en vez de estructuras de datos y resultados en forma de texto en la consola.</p>

<p>A trav&#xE9;s de los a&#xF1;os, Processing se ha transformado en una gran comunidad. Es usado en salas de clases a lo largo del mundo, en planes de estudios de artes, humanidades y ciencias de la computaci&#xF3;n y de forma profesional.</p>

<p>Hace dos a&#xF1;os, Ben y Casey me hicieron una pregunta: &#xBF;c&#xF3;mo ser&#xED;a Processing si funcionara en la web? p5.js nace con el objetivo original de Processing, hacer que programar sea accesible para artistas, dise&#xF1;adores, educadores y principiantes, y luego lo reinterpreta para la web actual usando JavaScript y HTML.</p>

<p>El desarrollo de p5.js ha sido como reunir mundos distintos. Para facilitar la transici&#xF3;n a la Web de los usuarios de la comunidad existente de Processing, seguimos la sintaxis y las convenciones de Processing tanto como fue posible. Sin embargo, p5.js est&#xE1; construido en JavaScript, mientras que Processing est&#xE1; construido en un lenguaje llamado Java. Estos dos lenguajes tienen distintos patrones y funciones, as&#xED; que en ocasiones nos tuvimos que alejar de la sintaxis ya familiar de Processing. Tambi&#xE9;n fue importante que p5.js pudiera ser integrado sin problemas a las existentes caracter&#xED;sticas, herramientas y estructuras de la web, para as&#xED; atraer a usuarios familiarizados con la Web, pero sin experiencia en programaci&#xF3;n creativa. Sintetizar todos estos factores fue un desaf&#xED;o, pero el objetivo de unir estas estructuras proporcion&#xF3; un camino claro a seguir en el desarrollo de p5.js.</p>

<p>Una primera versi&#xF3;n beta fue lanzada en agosto del 2014. Desde ese entonces, ha sido usado e integrado a programas de estudios en todo el mundo. Existe un editor oficial de p5.js que est&#xE1; actualmente en desarrollo, y se est&#xE1; progresando en muchas nuevas caracter&#xED;sticas y bibliotecas. </p>

<p> p5.js es un esfuerzo comunitario - cientos de personas han contribuido funciones esenciales, soluciones a errores, ejemplos, documentaci&#xF3;n, dise&#xF1;o, reflexiones y discusi&#xF3;n. Pretendemos continuar la visi&#xF3;n y el esp&#xED;ritu de la comunidad de Processing mientras la expandimos a&#xFA;n m&#xE1;s en la Web.</p>

<section data-type="sect1" id="how_this_book_is_organized" class="pagebreak-before">
<h1>C&#xF3;mo est&#xE1; organizado este libro</h1>

<p>Los cap&#xED;tulos de este libro est&#xE1;n organizados de la siguiente manera:</p>

<ul>
	<li>
	<p><a href="#hello">1/Hola</a>: aprende sobre p5.js.</p>
	</li>
	<li>
	<p><a href="#starting_to_code">2/Empezando a programar</a>: crea tu primer programa en p5.js.</p>
	</li>
	<li>
	<p><a href="#draw">3/Dibujar</a>: define y dibuja figuras simples.</p>
	</li>
	<li>
	<p><a href="#variables">4/Variables</a>: almacena, modifica y reusa datos.</p>
	</li>
	<li>
	<p><a href="#response">5/Respuesta</a>: controla e influye en programas con el rat&#xF3;n, el teclado y el tacto.</p>
	</li>
	<li>
	<p><a href="#translate">6/Trasladar, rotar, escalar</a>: transforma las coordenadas.</p>
	</li>
	<li>
	<p><a href="#media">7/Medios</a>: carga y muestra medios, incluyendo im&#xE1;genes y tipos de letras.</p>
	</li>
	<li>
	<p><a href="#motion">8/Movimiento</a>: mueve y coreograf&#xED;a figuras.</p>
	</li>
	<li>
	<p><a href="#functions">9/Funciones</a>: construye nuevos m&#xF3;dulos de c&#xF3;digo.</p>
	</li>
	<li>
	<p><a href="#objects">10/Objetos</a>: crea m&#xF3;dulos de c&#xF3;digo que combinan variables y funciones.</p>
	</li>
	<li>
	<p><a href="#arrays">11/Arreglos</a>: simplifica el trabajo con listas de variables.</p>
	</li>
	<li>
	<p><a href="#data">12/Datos</a>: carga y visualiza datos.</p>
	</li>
	<li>
	<p><a href="#extend">13/Extensi&#xF3;n</a>: aprende sobre sonido y DOM.</p>
	</li>
</ul>
</section>

<section data-type="sect1" id="who_this_book_is_for">
<h1>Para qui&#xE9;n es este libro</h1>

<p>Este libro fue escrito para personas que quieren crear im&#xE1;genes y programas interactivos simples con una introducci&#xF3;n casual y concisa a la programaci&#xF3;n de computadores. Es para personas que quieren una ayuda para entender los miles de ejemplos de c&#xF3;digo en p5.js y los manuales de referencia disponibles en la web de forma gratuita y libre. <em>Introducci&#xF3;n a p5.js</em> no es un libro de referencia sobre programaci&#xF3;n; como el t&#xED;tulo lo sugiere, te ayudar&#xE1; a empezar. Es &#xFA;til para adolescentes, adultos, entusiastas y cualquier persona interesada.</p>

<p>Este libro tambi&#xE9;n es apropiado para personas con experiencia en programaci&#xF3;n que quieran aprender los conceptos b&#xE1;sicos de gr&#xE1;ficos computacionales interactivas. <em>Introducci&#xF3;n a p5.js</em> contiene t&#xE9;cnicas que pueden ser aplicadas en la creaci&#xF3;n de juegos, animaciones e interfaces.</p>
</section>

<section data-type="sect1" id="conventions_used_in_this_book">
<h1>Convenciones usadas en este libro</h1>

<p>En este libro se usan las siguientes convenciones tipogr&#xE1;ficas:</p>

<dl>
	<dt><em>Cursivas</em></dt>
	<dd>
	<p>Indican nuevos t&#xE9;rminos, URLS, direcciones de email, nombres de archivos y extensiones de archivos.</p>
	</dd>
	<dt><code>Ancho constante</code></dt>
	<dd>
	<p>Usado para listados de programas y dentro de p&#xE1;rrafos para referirse a elementos de programas como nombres de variables o funciones, bases de datos, tipos de datos, variables de ambiente, declaraciones y palabras clave.</p>
	</dd>
	<dt><em><code>Ancho constante y cursiva</code></em></dt>
	<dd>
	<p>Muestra texto que deber&#xED;a ser reemplazado por valores provistos por el usuario o por valores determinados por el contexto.</p>
	</dd>
</dl>

<div data-type="note">
<p>Este tipo de p&#xE1;rrafo indica una nota general.</p>
</div>
</section>

<section data-type="sect1" id="using_code_examples">
<h1>Uso de ejemplos de c&#xF3;digo</h1>

<p>Este libro est&#xE1; aqu&#xED; para ayudarte a que logres hacer tu trabajo. En general, puedes usar el c&#xF3;digo de este libro en tus programas y documentaci&#xF3;n. No necesitas contactarnos para pedir permiso a menos que est&#xE9;s reproduciendo una porci&#xF3;n significativa del c&#xF3;digo. Por ejemplo, escribir un programa que usa m&#xFA;ltiples trozos de c&#xF3;digo de este libro no requiere permiso. S&#xED; requiere permiso la venta o distribuci&#xF3;n de ejemplos de libros Make:. Responder una pregunta citando este libro y citar c&#xF3;digos de ejemplo no requiere permiso. Sí requiere permiso incorporar una cantidad significativa de c&#xF3;digo de ejemplo de este libro en la documentaci&#xF3;n de tu producto.</p>

<p>Apreciamos, pero no requerimos, atribuci&#xF3;n. Una atribuci&#xF3;n usualmente incluye el t&#xcd;tulo, autor, editorial e ISBN. Por ejemplo: &#x201c; <em>Make: Getting Started with p5.js</em> por Lauren McCarthy, Casey Reas y Ben Fry, Copyright 2015 Maker Media, Inc., 978-1-457-18677-6."</p>

<p>Si sientes que tu uso de los ejemplos de c&#xF3;digo se aleja del uso justo o de los permisos dados aqu&#xcd;, si&#xe9;ntete libre de contactarnos en <a href="mailto:permissions@oreilly.com">permissions@oreilly.com</a>.</p>
</section>

<section data-type="sect1" id="_safari_books_online">
<h1>Safari® Books Online</h1>

<div class="safarienabled">
<p><a class="orm:hideurl:ital" href="http://safaribooksonline.com"><em class="hyperlink">Safari Books Online</em></a> es una biblioteca digital on-demand que ofrece <a class="orm:hideurl" href="https://www.safaribooksonline.com/explore/">contenido</a> experto en los formatos libro y video de los autores l&#xed;deres del mundo en tecnolog&#xed;a y negocios.</p>
</div>

<p>Profesionales de la tecnolog&#xed;a, desarrolladores de software, dise&#xf1;adores web y profesionales de negocios y creativos usan Safari Books Online como su fuente principal de investigaci&#xf3;n, resoluci&#xf3;n de problemas, aprendizaje y entrenamiento certificado.</p>

<p>Safari Books Online ofrece un rango de <a class="orm:hideurl" href="https://www.safaribooksonline.com/pricing/">planes y precios</a> para el sector <a class="orm:hideurl" href="https://www.safaribooksonline.com/enterprise/">empresarial</a>, <a class="orm:hideurl" href="https://www.safaribooksonline.com/government/">gubernamental</a>, <a class="orm:hideurl" href="https://www.safaribooksonline.com/academic-public-library/">educacional</a>, y para individuos.</p>

<p>Los miembros tienen acceso a miles de libros, videos de entrenamiento y manuscritos prepublicados en una base de datos completamente buscable de editores como Maker Media, O’Reilly Media, Prentice Hall Professional, Addison-Wesley Professional, Microsoft Press, Sams, Que, Peachpit Press, Focal Press, Cisco Press, John Wiley &amp; Sons, Syngress, Morgan Kaufmann, IBM Redbooks, Packt, Adobe Press, FT Press, Apress, Manning, New Riders, McGraw-Hill, Jones &amp; Bartlett, Course Technology, y cientos <a class="orm:hideurl" href="https://www.safaribooksonline.com/our-library/">m&#xe1;s</a>. Para m&#xe1;s informaci&#xf3;n sobre Safari Books Online, por favor vis&#xed;tanos <a class="orm:hideurl" href="http://safaribooksonline.com/">en l&#xed;nea</a>.</p>
</section>

<section data-type="sect1" id="how_to_contact_us">
<h1>C&#xf3;mo contactarnos</h1>

<p>Por favor dirige tus comentarios y preguntas sobre este libro a a la editorial:</p>

<ul class="simplelist">
	<li>Maker Media, Inc.</li>
	<li>1160 Battery Street East, Suite 125</li>
	<li>San Francisco, California 94111</li>
	<li>800-998-9938 (en Estados Unidos o Canad&#xe1;)</li>
	<li><a href='http://makermedia.com/contact-us/'><em>http://makermedia.com/contact-us/</em></a></li>
</ul>

<p>Make: une, inspira, informa y entretiene a una creciente comunidad de gente inventiva que se embarca en proyectos asombrosos en sus patios, s&#xf3;tanos y cocheras. Make: celebra tu derecho de modificar, hackear y torcer cualquier tecnolog&#xed;a como quieras. La audiencia de Make: sigue siendo una cultura en expansi&#xf3;n y una comunidad que cree en mejorarnos a nosotros mismos, a nuestro medio ambiente, a nuestro sistema educacional - al mundo entero. Esto es mucho m&#xe1;s que una audiencia, es un movimiento mundial que Make: est&#xe1; liderando - lo llamamos el movimiento Maker.</p>

<p>Para m&#xe1;s informaci&#xf3;n sobre Make:, vis&#xed;tanos en l&#xed;nea:</p>

<ul class="simplelist">
	<li>Make: magazine: <a href="http://makezine.com/magazine/"><em class="hyperlink">http://makezine.com/magazine/</em></a></li>
	<li>Maker Faire: <a href="http://makerfaire.com"><em class="hyperlink">http://makerfaire.com</em></a></li>
	<li>Makezine.com: <a href="http://makezine.com"><em class="hyperlink">http://makezine.com</em></a></li>
	<li>Maker Shed: <a href="http://makershed.com/"><em class="hyperlink">http://makershed.com/</em></a></li>
</ul>
</section>

<section data-type="sect1" id="acknowledgments">
<h1>Agradecimientos</h1>

<p>Le agradecemos a Brian Jepson y a Anna Kaziunas France por su gran energ&#xED;a, apoyo y visi&#xF3;n.</p>

<p>No podemos imaginar este libro sin <em>Getting Started with Arduino</em> (Maker Media) de Massimo Banzi. El excelente libro de Massimo fue el prototipo.</p>

<p>Un peque&#xF1;o grupo de individuos ha, durante a&#xF1;os, contribuido tiempo y energ&#xED;a esenciales a Processing. Dan Shiffman es nuestro compa&#xF1;ero en la Fundaci&#xF3;n Processing, la organizaci&#xF3;n 501(c)(3) que apoya al software Processing. La mayor parte del c&#xF3;digo principal de Processing 2.0 y Processing 3.0 proviene de las mentes brillantes de Andres Colubri y Manindra Moharana. Scott Murray, Jamie Kosoy y Jon Gacnik han construido una maravillosa infraestructura web para el proyecto. James Grady est&#xE1; haciendo un genial trabajo en la interfaz de usuario 3.0. Le agradecemos a Florian Jenett por sus a&#xF1;os de trabajo en diversas &#xE1;reas, incluyendo foros, sitio web y dise&#xF1;o. Elie Zananiri y Andreas Schlegel han creado la infraestructura para construir y documentar las bibliotecas contribuidas y han pasado innumerables horas curando las listas. Muchos otros han contribuido significativamente al proyecto, los datos precisos est&#xE1;n disponibles en <a href="https://github.com/processing"><em class="hyperlink">https://github.com/processing</em></a>.</p>

<p> Este libro surgi&#xF3; de la ense&#xF1;anza con Processing en UCLA. Chandler McWilliams ha sido instrumental en definir estas clases. Casey le agradece a los estudiantes de pregrado en el Departamento de Design Media Arts en UCLA por su energ&#xED;a y entusiasmo. Sus ayudantes del curso han sido grandes colaboradores para definir c&#xF3;mo Processing es ense&#xF1;ado. Agradecimientos a Tatsuya Saito, John Houck, Tyler Adams, Aaron Siegel, Casey Alt, Andres Colubri, Michael Kontopoulos, David Elliot, Christo Allegra, Pete Hawkes y Lauren McCarthy.</p>

<p>p5.js es desarrollado por una gran comunidad de contribuyentes a lo largo del mundo. Dan Shiffman, Jason Sigal, Sam Lavigne, K.Adam White, Chandler McWilliams, Evelyn Eastmond, los miembros del grupo de trabajo de p5 en ITP, los asistentes a la primera p5.js Contributor's Conference en el Frank-Ratchye STUDIO for Creative Inquiry de Carnegie Mellon University, y los estudiantes y mentores del Processing Google Summer of Code han sido instrumentales para hacer que p5.js sea lo que es hoy. Apoyo significativo para el proyecto ha sido provisto por la Processing Foundation, NYU ITP, RISD y Bocoup. Puedes ver la lista de lista completa de contribuyentes en <a href="https://github.com/processing/p5.js#contributors"><em class="hyperlink">https://github.com/processing/p5.js#contributors</em></a>. Lauren tambi&#xE9;n le agradece a Kyle McDonald por su perpetuo apoyo e inspiraci&#xF3;n.</p>

<p>Este libro ha sido transformado por las art&#xED;sticas ilustraciones de Taeyoon Choi. Fueron desarrolladas en parte a trav&#xE9;s de una residencia en el Frank-Ratchye STUDIO for Creative Inquiry en Carnegie Mellon University, con apoyo del programa Art Works del National Endowment for the Arts. Charlotte Stiles ayud&#xF3; tremendamente con la edici&#xF3;n de los ejemplos e im&#xE1;genes de este libro.</p>

<figure id="acknowledge"><img src="images/gspj_00in02.png"/><figcaption/></figure>

<p>A trav&#xE9;s de la fundaci&#xF3;n del Aesthetics and Computation Group (1996–2002) en el MIT Media Lab, John Maeda hizo todo esto posible.</p>

</section>
</section>
