<section class="pagenumrestart" data-type="chapter" id="hello">
<h1 class="chapterhead">Hola</h1>

<p class="lede">p5.js sirve para&nbsp;<a contenteditable="false" data-primary="sketching with code overview" data-type="indexterm" id="swc1ov">&nbsp;</a>escribir software que produce im&#xE1;genes, animaciones e interacciones. La motivaci&#xF3;n es escribir una l&#xED;nea de c&#xF3;digo y que un c&#xED;rculo aparezca en la pantalla. A&#xF1;ade unas pocas l&#xED;neas de c&#xF3;digo, y ahora el c&#xED;rculo sigue al rat&#xF3;n. Otra l&#xED;nea de c&#xF3;digo, y el c&#xED;rculo cambia de color cuando presionas el rat&#xF3;n. A &nbsp;esto lo llamamos <em>bosquejar</em> con c&#xF3;digo. Escribes una l&#xED;nea, luego a&#xF1;ades otra, luego otra, y as&#xED;. El resultado es un programa creado parte por parte.</p>

<p>Los cursos de programaci&#xF3;n t&#xED;picamente se enfocan primero en estructura y teor&#xED;a. Cualquier aspecto visual - una interfaz, una animaci&#xF3;n - es considerado un postre que solo puede ser disfrutado despu&#xE9;s de que terminas de comer tus vegetales, el equivalente a varias semanas de estudiar algoritmos y m&#xE9;todos. A trav&#xE9;s de los a&#xF1;os, hemos visto a muchos amigos tratar de tomar estos cursos, para luego abandonarlos despu&#xE9;s de la primera sesi&#xF3;n o despu&#xE9;s de una muy larga y frustrante noche previa a la entrega de la primera tarea. Toda curiosidad inicial que ten&#xED;an sobre c&#xf3;mo hacer que el computador trabaje para ellos es perdida porque no pueden vislumbrar un camino claro entre lo que tienen que aprender al principio y lo que quieren crear.</p>

<p>p5.js ofrece una manera de programar a trav&#xE9;s de la creaci&#xF3;n de gr&#xE1;ficas interactivas. Existen muchas maneras posibles de ense&#xF1;ar c&#xF3;digo, pero los estudiantes usualmente encuentran apoyo y motivaci&#xF3;n al tener una retroalimentaci&#xF3;n visual inmediata. p5.js provee esta retroalimentaci&#xF3;n, y su &#xE9;nfasis en im&#xE1;genes, prototipado y comunidad es discutido en las siguientes p&#xE1;ginas.</p>

<section data-type="sect1" class="pagebreak-before">
<h1>Bosquejo y prototipado</h1>

<p>Bosquejar &nbsp;es una forma de pensar; es juguet&#xF3;n y r&#xE1;pido. El objetivo b&#xE1;sico es explorar muchas ideas en un corto periodo de tiempo. En nuestro propio trabajo, usualmente empezamos bosquejando en papel y luego trasladamos nuestros resultados a c&#xF3;digo. Las ideas para animaci&#xF3;n e interacci&#xF3;n son usualmente bosquejadas como un gui&#xF3;n gr&#xE1;fico con anotaciones. Despu&#xE9;s de hacer algunos bosquejos en software, las mejores ideas son seleccionadas y combinadas en prototipos (<a data-type="xref" href="#Fig_01_01">Figura 1-1</a>). Es un proceso c&#xED;clico de hacer, probar y mejorar que va y viene entre papel y pantalla.</p>

<figure id="Fig_01_01"><img alt="Fig 01 01" src="images/gspj_0101.png" />
<figcaption><b>Figura 1-1. </b>A medida que los dibujos pasan de un cuaderno de bosquejos a la pantalla, van emergiendo nuevas posibilidades</figcaption>
</figure>
</section>

<section data-type="sect1" class="pagebreak-before">
<h1>Flexibilidad</h1>

<p>Tal como un cintur&#xF3;n de herramientas para software, p5.js est&#xe1; compuesto de muchas herramientas que funcionan en conjunto y en diversas combinaciones. Como resultado, puede ser usado para exploraciones r&#xE1;pidas o para investigaci&#xF3;n en profundidad. Como un programa hecho con p5.js puede ser tan corto como unas pocas l&#xED;neas de c&#xF3;digo o tan largo como miles de l&#xED;neas, existe espacio para crecimiento y variaci&#xF3;n. Las bibliotecas de p5.js lo extienden a otros dominios incluyendo el trabajo con sonido y la inclusi&#xF3;n de botones, barras deslizadoras, ingreso de datos y captura de c&#xE1;mara con HTML.</p>
</section>

<section data-type="sect1">
<h1>Gigantes</h1>

<p>Las personas han estado haciendo im&#xE1;genes con computadores desde los a&#xF1;os 1960s, y hay mucho que podemos aprender de esta historia. Por ejemplo, antes de que los computadores pudieran proyectar a pantallas CRT o LCD, se usaban grandes m&#xE1;quinas trazadoras (<a data-type="xref" href="#Fig_01_02">Figura 1-2</a>) para dibujar las im&#xE1;genes. En la vida, todos nos paramos sobre hombros de gigantes, y los titanes de p5.js incluyen pensadores del dise&#xF1;o, gr&#xE1;fica computacional, arte, arquitectura, estad&#xED;stica y otras disciplinas afines. Dale un vistazo a <em>Sketchpad</em> (1963) de Ivan Sutherland, <em>Dynabook</em> (1968) de Alan Kay y a otros artistas destacados en el libro de Ruth Leavitt <em>Artist and Computer </em><span data-type="footnote"><a href="http://www.atariarchives.org/artist/"><em class="hyperlink">http://www.atariarchives.org/artist/</em></a></span> (Harmony Books, 1976). Los archivos de ACM SIGGRAPH y de Ars Electronica brindan atisbos fascinantes en la historia de la gr&#xE1;fica y el software.</p>

<figure id="Fig_01_02"><img alt="Fig 01 02" src="images/gspj_0102-2.png" />
<figcaption><b>Figura 1-2. </b>Demostraci&#xf3;n de dibujo por Manfred Mohr en el Musée d'Art Moderne de la Ville de Paris usando la trazadora Benson y un computador digital, 11 de mayo 1971 (foto por Rainer Mürle, cortes&#xed;a de bitforms gallery, New York)</figcaption>
</figure>
</section>

<section data-type="sect1" class="pagebreak-before">
<h1>&#xC1;rbol familiar</h1>

<p>Tal como los lenguajes humanos, los lenguajes de programaci&#xF3;n pertenecen a familias de lenguajes relacionados. p5.js es un dialecto de un lenguaje de programaci&#xF3;n llamado<a contenteditable="false" data-primary="JavaScript" data-type="indexterm">&nbsp;</a>JavaScript.&nbsp;La sintaxis del lenguaje es casi id&#xE9;ntica, pero p5.js a&#xF1;ade caracter&#xED;sticas personalizadas relacionadas a gr&#xE1;ficas e interacci&#xF3;n (<a data-type="xref" href="#Fig_01_03">Figura 1-3</a>) y provee un acceso simple a caracter&#xED;sticas nativas de HTML5 que ya est&#xE1;n soportadas por los navegadores web. Por estas caracter&#xED;sticas compartidas, aprender p5.js es un primer paso &#xFA;til para aprender a programar en otros lenguajes y usar otras herramientas computacionales.</p>

<figure id="Fig_01_03"><img alt="Fig 01 03" src="images/gspj_0103.png" />
<figcaption><b>Figura 1-3. </b>p5.js posee una gran familia de lenguajes y ambientes de programaci&#xf3;n relacionados</figcaption>
</figure>
</section>

<section data-type="sect1">
<h1>&#xDA;nete</h1>

<p>Miles de personas usan p5.js cada d&#xED;a. Al igual que ellos, t&#xFA; puedes descargar p5.js gratuitamente. Incluso tienes la opci&#xF3;n de modificar el c&#xF3;digo de p5.js para que se adapte a tus necesidades. p5.js es un proyecto FLOSS (free/libre/open source software, lo que significa software gratis libre y de c&#xf3;digo abierto), y siguiendo el esp&#xED;ritu de esta comunidad, te alentamos a participar y compartir tus proyectos y tu conocimiento&nbsp;<a contenteditable="false" data-primary="sketching with code overview" data-startref="swc1ov" data-type="indexterm">&nbsp;</a>en <em class="hyperlink"><a href="http://p5js.org/es">http://p5js.org/es</a></em> (<a data-type="xref" href="#Fig_01_04">Figura 1-4</a>).</p>

<figure id="Fig_01_04"><img alt="Fig 01 04" src="images/gspj_0104.png" />
<figcaption><b>Figura 1-4. </b>p5.js es promovido por una comunidad de personas que contribuyen a trav&#xe9;s de Internet</figcaption>
</figure>
</section>
</section>
