<section data-type="chapter" id="data" xmlns="http://www.w3.org/1999/xhtml">
<h1 class="chapterhead">Datos</h1>

<p class="lede">La <a contenteditable="false" data-primary="data" data-type="indexterm" id="d12">&nbsp;</a>visualizaci&#xF3;n de datos es una de las &#xE1;reas m&#xE1;s activas en la intersecci&#xF3;n de la programaci&#xF3;n y los gr&#xE1;ficos y tambi&#xE9;n uno de los usos m&#xE1;s populares de p5.js. Este cap&#xED;tulo expande lo que se ha discutido en el libro sobre almacenamiento y carga de datos e introduce  caracter&#xED;sticas adicionales relevantes a conjuntos de datos que pueden ser usadas para visualizaci&#xF3;n.</p>

<p>Existe un gran rango de software que puede producir visualizaciones est&#xE1;ndar como gr&#xE1;ficos de barras y gr&#xE1;ficos de dispersi&#xF3;n. Sin embargo, escribir c&#xF3;digo desde cero para crear visualizaci&#xF3;n nos brinda mayor control sobre el resultado y anima a los usuarios a imaginar, explorar y crear representaciones &#xFA;nicas de datos. Para nosotros, esta es la raz&#xf3;n para programar y usar software como p5.js, y encontramos mucho m&#xE1;s interesante esto que estar limitado por m&#xE9;todos prefabricados o herramientas ya disponibles.</p>

<section data-type="sect1">
<h1>Resumen de datos</h1>

<p>Es un <a contenteditable="false" data-primary="data" data-secondary="overview" data-type="indexterm">&nbsp;</a>buen momento para rebobinar y discutir sobre c&#xF3;mo los datos fueron introducidos a trav&#xE9;s de este libro. Una variable en un bosquejo de p5.js es usada para almacenar datos. Empezamos con variables primitivas. En este caso, la palabra <a contenteditable="false" data-primary="primitives" data-type="indexterm">&nbsp;</a><em>primitiva</em> significa un solo trozo de informaci&#xF3;n. Por ejemplo, una variable puede almacenar un n&#xFA;mero o un string.</p>

<p>Un arreglo es creado para almacenar una lista de elementos dentro de un &#xFA;nico nombre de variable. Por ejemplo, <a data-type="xref" href="#ex-11-7">#ej-11-7</a> almacena cientos de n&#xFA;meros usados para definir el valor del trazo de las l&#xED;neas. Un objeto es una variable que almacena un conjunto de variables y funciones relacionadas.</p>

<p>Las variables y los objetos pueden ser definidos dentro del c&#xF3;digo, pero tambi&#xE9;n pueden ser cargados dentro de un archivo en el directorio del <em>bosquejo</em>. Los siguientes ejemplos en este cap&#xED;tulo lo demuestran.</p>
</section>

<section data-type="sect1">
<h1>Tablas</h1>

<p>Muchos <a contenteditable="false" data-primary="data" data-secondary="tables" data-type="indexterm" id="d12t">&nbsp;</a>conjuntos de datos son almacenados como filas y columnas (ver <a data-type="xref" href="#Fig_12_01">Figura 12-1</a>), as&#xED; que p5.js incluye un objeto tabla <a contenteditable="false" data-primary="table data" data-type="indexterm" id="td12">&nbsp;</a>para hacer m&#xE1;s f&#xE1;cil trabajar con ellos. Si has trabajado con hojas de c&#xE1;lculo, tienes una ventaja al momento de trabajar con tablas y c&#xf3;digo. p5.js puede leer una tabla desde un archivo, o crear directamente una nueva con c&#xF3;digo. Tambi&#xE9;n es posible leer y escribir cualquier fila y columna y modificar celdas individuales dentro de la tabla. En este cap&#xED;tulo, nos enfocaremos en trabajar con datos en tablas.</p>

<figure id="Fig_12_01"><img alt="Fig 12 01" src="images/gspj_1201.png" />
<figcaption><b>Figura 12-1. </b>Las tables son matrices de celdas. Las filas son elementos verticales y las columnas son horizontales. Los datos pueden ser le&#xed;dos desde celdas individuales, filas y columnas.</figcaption>
</figure>

<p>Los datos en tablas son usualmente almacenados en archivos de texto planos con columnas usando comas o tabulaci&#xF3;n. Un archivo del tipo  <a contenteditable="false" data-primary="archivo CSV (valores separados por comas)" data-type="indexterm">&nbsp;</a><em>CSV</em> usa la extensi&#xF3;n de archivo <em>.csv</em>.Cuando se usa tabulaci&#xF3;n, la extensi&#xF3;n <em>.tsv</em> puede ser usada.</p>

<p>Para cargar un archivo CSV o <a contenteditable="false" data-primary="TSV (tab-separated values) file" data-type="indexterm">&nbsp;</a>TSV, primero ponlo en el directorio del bosquejo tal como se describe en el inicio del <a data-type="xref" href="#media">#media</a>, y luego usa la funci&#xF3;n <span class="keep-together"><code>loadTable()</code></span> para obtener los datos y ponerlos en un objeto.</p>

<div data-type="note">
<p>Solamente las primeras l&#xED;neas de cada conjunto de datos son mostradas en estos ejemplos. Si est&#xE1;s escribiendo manualmente el c&#xF3;digo, necesitar&#xE1;s el archivo <em>.csv</em>, <em>.json</em>, o <em>.tsv</em> completo para replicar las visualizaciones mostradas en las figuras. Puedes encontrarlos en el archivo <em>media.zip</em>.</p>
</div>

<p>Los datos para el siguiente ejemplo son una versi&#xF3;n simplificada de las estad&#xED;sticas del jugador David Ortiz del equipo Red Sox, entre 1997 y 2014. De izquierda a derecha, est&#xE1; el a&#xF1;o, el n&#xFA;mero de home runs, carreras remolcadas (RBIs), y promedio de bateo. Cuando el archivo es abierto en un editor de texto, las primeras cinco l&#xED;neas del archivo se ven as&#xED;:</p>

<pre data-type="programlisting">
1997,1,6,0.327
1998,9,46,0.277
1999,0,0,0
2000,10,63,0.282
2001,18,48,0.234</pre>

<section data-type="sect2">
<h2>Ejemplo 12-1: lee la tabla</h2>

<p>Para cargar los datos en p5.js, se crea un objeto usando el constructor <code>p5.Table</code>. El objeto en este ejemplo es llamado <code>stats</code>. La funci&#xF3;n loadTable() <code>loadTable()</code> <a contenteditable="false" data-primary="loadTable() function" data-type="indexterm">&nbsp;</a> carga el archivo <em>ortiz.csv</em>&nbsp;desde el directorio de tu <em>bosquejo</em>. La funci&#xF3;n se encuentra<a contenteditable="false" data-primary="preload() function" data-type="indexterm">&nbsp;</a> dentro de <code>preload()</code> para asegurar que est&#xE9; completamente cargada antes de que los datos sean usados en <code>setup()</code>.</p>

<p>En <code>setup()</code>, el bucle <code>for</code> <a contenteditable="false" data-primary="for loops" data-type="indexterm">&nbsp;</a>lee cada fila de la tabla en secuencia. Obtiene los datos desde la tabla y los almacena en variables. El m&#xE9;todo <code>getRowCount()</code> <a contenteditable="false" data-primary="getRowCount() function" data-type="indexterm">&nbsp;</a>es usado para contar el n&#xFA;mero de filas en cada archivo de datos. Como los datos sobre las estad&#xED;sticas de Ortiz van de 1997 a 2014, hay 18 filas que leer:</p>

<pre data-code-language="p5js" data-type="programlisting">
var stats;

function preload() {
  stats = loadTable("ortiz.csv");
}

function setup() {
  for (var i = 0; i &lt; stats.getRowCount(); i++) {
    // Obtiene el valor de la fila i, columna 0 del archivo
    var year = stats.get(i, 0);
    // Obtiene el valor de la fila i, columna 1
    var homeRuns = stats.get(i, 1);
    var rbi = stats.get(i, 2);
    var average = stats.get(i, 3);
    print(year, homeRuns, rbi, average);
  }
}</pre>

<p>Dentro del bucle <code>for</code> loop, el m&#xE9;todo <code>get()</code> <a contenteditable="false" data-primary="get() function" data-type="indexterm">&nbsp;</a>es usado para acceder a datos desde la tabla. Este m&#xE9;todo tiene dos par&#xE1;metros: el primero es la fila a leer y el segundo es la columna.</p>
</section>

<section data-type="sect2">
<h2>Ejemplo 12-2: dibuja la tabla</h2>

<p>El <a contenteditable="false" data-primary="drawing" data-secondary="tables" data-type="indexterm" id="dr12t">&nbsp;</a>siguiente ejemplo construye sobre el anterior. Crea un arreglo llamado <code>homeRuns</code> para almacenar los datos despu&#xE9;s de ser cargados dentro de <code>setup()</code> y los datos del arreglo son usados dentro de <code>draw()</code>. El largo del arreglo es usado dos veces con el c&#xF3;digo <code>homeRuns.length</code>, para contar el n&#xFA;mero de iteraciones de un bucle <code>for</code>. Primero es usado para poner una marca vertical por cada elemento en el arreglo. Luego es usado para leer cada elemento del arreglo uno por uno y parar de leer del arreglo cuando termina. Despu&#xE9;s de que los datos son cargados dentro de  <code>preload()</code> y le&#xED;dos desde el arreglo en <code>setup()</code>, el resto de este programa aplica lo que aprendimos en el <a data-type="xref" href="#arrays">#arreglos</a>. La funci&#xF3;n <code>getNum()</code> es usada en vez de <code>get()</code> para asegurar que el valor sea entendido como un n&#xFA;mero a usar en el gr&#xE1;fico.</p>

<p>Este ejemplo es la visualizaci&#xF3;n de una versi&#xF3;n simplificada de las estad&#xED;sticas de bateo entre 1997 y 2014 del jugador David Ortiz de los Boston Red Sox, dibujados con los datos de una tabla:</p>

<figure id="Fig_ex-12-2"><img alt="Ex 12 02" src="images/gspj_12in02.png" />
<figcaption/>
</figure>

<pre data-code-language="p5js" data-type="programlisting">
var stats;
var homeRuns = [];

function preload() {
  stats = loadTable("ortiz.csv");
}

function setup() {
  createCanvas(480, 120);
  var rowCount = stats.getRowCount();
  homeRuns = [];
  for (var i = 0; i &lt; rowCount; i++) {
    homeRuns[i] = stats.getNum(i, 1);
  }
}

function draw() {
  background(204);
  // Dibuja la matriz de fondo para los datos
  stroke(153);
  line(20, 100, 20, 20);
  line(20, 100, 460, 100);
  for (var i = 0; i &lt; homeRuns.length; i++) {
    var x = map(i, 0, homeRuns.length-1, 20, 460);
    line(x, 20, x, 100);
  }
  // Dibuja l&#xED;neas basadas en los datos de home run
  noFill();
  stroke(0);
  beginShape();
  for (var i = 0; i &lt; homeRuns.length; i++) {
    var x = map(i, 0, homeRuns.length-1, 20, 460);
    var y = map(homeRuns[i], 0, 60, 100, 20);
    vertex(x, y);
  }
  endShape();
}</pre>

<p>Este ejemplo es tan minimalista que no es necesario guardar estos datos en un arreglo, pero la idea puede ser aplicada a ejemplos m&#xE1;s complejos que podr&#xED;as querer hacer en el futuro. Adicionalmente, puedes ver c&#xF3;mo este ejemplo puede ser expandido con m&#xE1;s informaci&#xF3;n - por ejemplo, la informaci&#xF3;n en el eje vertical puede definir el n&#xFA;mero de home runs y en el horizontal definir el<a contenteditable="false" data-primary="drawing" data-secondary="tables" data-startref="dr12t" data-type="indexterm">&nbsp;</a> a&#xF1;o.</p>
</section>

<section data-type="sect2">
<h2>Ejemplo 12-3: 29.740 ciudades</h2>

<p>Para tener una mejor idea del potencial de trabajar con tablas de datos, el siguiente ejemplo usa un conjunto de datos m&#xE1;s grande e introduce una caracter&#xED;stica conveniente.&nbsp;Esta tabla de datos es diferente, porque la primera fila, la primera l&#xED;nea en el archivo, es un <a contenteditable="false" data-primary="headers" data-type="indexterm">&nbsp;</a><em>encabezado</em>. El encabezado define una etiqueta por columna para clarificar el contexto. Estas son las primeras cinco l&#xED;neas de nuestro archivo de datos llamado <em>cities.csv</em>:</p>

<pre data-type="programlisting">
zip,state,city,lat,lng
35004,AL,Acmar,33.584132,-86.51557
35005,AL,Adamsville,33.588437,-86.959727
35006,AL,Adger,33.434277,-87.167455
35007,AL,Keystone,33.236868,-86.812861
</pre>

<p>El encabezado hace m&#xE1;s f&#xE1;cil leer el c&#xF3;digo - por ejemplo, la segunda l&#xED;nea del archivo establece que el c&#xF3;digo zip de Acmar, Alabama es 35004 y define la latitud de la ciudad como 33.584132 y la longitud como -86.51557. En total, el archivo tiene un largo de 29.741 l&#xED;neas y define la ubicaci&#xF3;n y los c&#xF3;digos zip de 29.740 ciudades en Estados Unidos. El siguiente ejemplo carga estos datos dentro la funci&#xF3;n <code>preload()</code>y luego los dibuja en la pantalla con un bucle <code>for</code> dentro de <code>draw()</code>. La funci&#xF3;n <code>setXY()</code> <a contenteditable="false" data-primary="setXY() function" data-type="indexterm">&nbsp;</a>convierte la latitud y la longitud de un archivo en una elipse en la pantalla:</p>

<figure><img alt="Ex 12 03" src="images/gspj_12in03.png" />
<figcaption/>
</figure>

<pre data-code-language="p5js" data-type="programlisting">
var cities;

function preload() {
  cities = loadTable("cities.csv", "header");
}

function setup() {
  createCanvas(480, 240);
  fill(255, 150);
  noStroke();
}

function draw() {
  background(0);
  var xoffset = map(mouseX, 0, width, -width*3, -width);
  translate(xoffset, -600);
  scale(10);
  for (var i = 0; i &lt; cities.getRowCount(); i++) {
    var latitude = cities.getNum(i, "lat");
    var longitude = cities.getNum(i, "lng");
    setXY(latitude, longitude);
  }
}

function setXY(lat, lng) {
  var x = map(lng, -180, 180, 0, width);
  var y = map(lat, 90, -90, 0, height);
  ellipse(x, y, 0.25, 0.25);
}</pre>

<p>Dentro de la funci&#xF3;n <code>preload()</code>, observa que hay un segundo par&#xE1;metro "header" a&#xF1;adido a la funci&#xF3;n <code>loadTable()</code>. Si esto no es realizado, el c&#xF3;digo tratar&#xE1; la primera l&#xED;nea del archivo CSV como datos y no como el t&#xED;tulo de cada columna.</p>

<p><code>p5.Table</code> posee docenas de m&#xE9;todos para lograr a&#xF1;adir y remover columnas y filas, obtener una lista de entradas &#xFA;nicas en una columna, o ordenar la tabla. Una lista m&#xE1;s completa de m&#xE9;todos y ejemplos cortos son incluidos en la <a contenteditable="false" data-primary="table data" data-startref="td12" data-type="indexterm">&nbsp;</a><a contenteditable="false" data-primary="data" data-secondary="tables" data-startref="d12t" data-type="indexterm">&nbsp;</a><em>Referencia de p5.js</em>.</p>
</section>
</section>

<section data-type="sect1">
<h1>JSON</h1>

<p>El formato JSON (JavaScript Object Notation) <a contenteditable="false" data-primary="data" data-secondary="JSON" data-type="indexterm" id="d12json">&nbsp;</a><a contenteditable="false" data-primary="JSON files" data-type="indexterm" id="jsonf12">&nbsp;</a>es otro sistema com&#xFA;n para almacenar datos. Tal como los formatos HTML y XML, los elementos tienen etiquetas asociadas a ellos. Por ejemplo, los datos de una pel&#xED;cula pueden incluir etiquetas para el t&#xED;tulo, director, a&#xF1;o de lanzamiento, calificaci&#xF3;n y m&#xE1;s. Estas etiquetas ser&#xE1;n emparejadas con datos de la siguiente manera:</p>

<pre class="de1" data-code-language="json" data-type="programlisting">
"title": "Alphaville"
"director": "Jean-Luc Godard"
"year": 1964
"rating": 9.1
</pre>

<p>Para funcionar como un archivo JOSN, se necesita un poco de puntuaci&#xF3;n para separar los elementos. Se usan comas entre cada par de datos y llaves para encapsular. Los datos definidos dentro de las llaves son un <a contenteditable="false" data-primary="JSON objects" data-type="indexterm">&nbsp;</a><em>object</em> JSON. Con estos cambios nuestro archivo de datos JSON con un formato v&#xE1;lido luce as&#xED;:</p>

<pre class="de1" data-code-language="json" data-type="programlisting">
{
  "title": "Alphaville",
  "director": "Jean-Luc Godard",
  "year": 1964,
  "rating": 9.1
}
</pre>

<p>Existe otro detalle interesante en este corto ejemplo JSON relacionado a los tipos de datos: te dar&#xE1;s cuenta que los datos de t&#xED;tulo y director est&#xE1;n encerrados en comillas para demarcarlos como datos de tipo string, mientras que el a&#xF1;o y la calificaci&#xF3;n no tienen comillas para definirlos como n&#xFA;meros. Esta distinci&#xF3;n se hace importante despu&#xE9;s de cargar los datos en un bosquejo.</p>

<p>Para a&#xF1;adir otra pel&#xED;cula a la lista, se usa un par de corchetes en el comienzo y el final del archivo JSON para significar que los datos son <a contenteditable="false" data-primary="JSONArray" data-type="indexterm">&nbsp;</a><a contenteditable="false" data-primary="data" data-secondary="JSONArray" data-type="indexterm">&nbsp;</a><a contenteditable="false" data-primary="arrays" data-secondary="JSONArray" data-type="indexterm">&nbsp;</a>un <code>arreglo</code> de objetos JSON. Cada objeto es separado por una coma. Poniendo todo esto en pr&#xE1;ctica, luce as&#xED;:</p>

<pre class="de1" data-code-language="json" data-type="programlisting">
[
  {
    "title": "Alphaville",
    "director": "Jean-Luc Godard",
    "year": 1965,
    "rating": 9.1
  },
  {
    "title": "Pierrot le Fou",
    "director": "Jean-Luc Godard",
    "year": 1965,
    "rating": 7.3
  }
]
</pre>

<p>Este patr&#xF3;n puede ser repetido para incluir m&#xe1;s pel&#xED;culas. En este punto, es interesante comparar esta notaci&#xF3;n JSON a la representaci&#xF3;n de tabla correspondiente a los mismos datos. Como un archivo CSV, los datos hubieran lucido as&#xED;:</p>

<pre class="de1" data-type="programlisting">
title, director, year, rating
Alphaville, Jean-Luc Godard, 1965, 9.1
Pierrot le Fou, Jean-Luc Godard, 1965, 7.3
</pre>

<p>Observa que la notaci&#xF3;n CSV usa menos caracteres, lo que puede ser importante al momento de trabajar con conjuntos enormes de datos. Por otro lado, la versi&#xF3;n JSON es usualmente m&#xE1;s f&#xE1;cil de leer porque cada trozo de informaci&#xF3;n est&#xE1; etiquetado.</p>

<p>Ahora que se han introducido las nociones b&#xE1;sicas de JSON y su relaci&#xF3;n con las tablas, revisemos el c&#xF3;digo necesario para cargar un archivo JSON a un bosquejo de p5.js.</p>

<section data-type="sect2" id="ex-12-4">
<h2>Ejemplo 12-4: leer un archivo JSON</h2>

<p>Este bosquejo carga el archivo JSON visto al principio de esta secci&#xF3;n, el archivo que incluye solamente los datos de la pel&#xED;cula <em>Alphaville</em>:</p>

<pre data-code-language="p5js" data-type="programlisting">
var film;

function preload() {
  film = loadJSON("film.json");
}

function setup() {
  var title = film.title;
  var dir = film.director;
  var year = film.year;
  var rating = film.rating;
  print(title + " por " + dir + ", " + year + <br />". Calificaci&#xf3;n: " + rating);
}</pre>

<p>Los datos del archivo son cargados en la variable. Los valores individuales pueden ser accesados usando el operador punto, de forma similar a como accedemos a las propiedades dentro de un objeto.</p>
</section>

<section data-type="sect2">
<h2>Ejemplo 12-5: visualiza datos a partir de un archivo JSON</h2>

<p>Tambi&#xE9;n podemos trabajar con un archivo JSON que contiene m&#xE1;s de una pel&#xED;cula. Aqu&#xED;, el archivo de datos comenzado en el ejemplo previo ha sido actualizado para incluir todas las pel&#xED;culas del director entre 1960 y 1966. El nombre de cada pel&#xED;cula es posicionado en orden en la pantalla seg&#xFA;n el a&#xF1;o de lanzamiento y es asignado un valor en la escala de grises seg&#xFA;n su calificaci&#xF3;n.</p>

<p>Existen varias diferencias entre este ejemplo y el <a data-type="xref" href="#ex-12-4">#ej-12-4</a>. La m&#xE1;s importante es la manera en que el archivo JSON es cargado en los objetos <code>Film</code>. El archivo JSON es cargado dentro de <code>preload()</code>, poblando la variable <code>filmData</code> con un arreglo que tiene la misma estructura que los datos en el archivo. En <code>setup()</code>, se usa un bucle <code>for</code> para iterar a trav&#xE9;s del arreglo de datos de las pel&#xED;culas y crear un objeto basado en cada elemento en el arreglo, usando el constructor <code>Film</code>  definido aqu&#xED;. El constructor accede a porciones de la informaci&#xF3;n y las asigna a propiedades dentro de cada objeto. El constructor <code>Film</code> tambi&#xE9;n define un m&#xE9;todo para mostrar el nombre de la pel&#xED;cula:</p>

<figure><img alt="Ex 12 05" src="images/gspj_12in04.png" />
<figcaption/>
</figure>

<!--
<div data-nickname="akaziuna" data-type="comment">
<div class="comment-identifier" contenteditable="false"><img src="https://secure.gravatar.com/avatar/e0080a854a5c1d5b8feb7567ee1b2eb2" />
<div spellcheck="false">akaziuna</div>
<i class="delete_comment glyphicons remove_2">&nbsp;</i></div>

<p>Note to Production: This may not matter at all, but a line in the code below keeps converting to:&nbsp;function Film✿ {</p>

<p>Spelled out, it should read:<br />
function Film "open parenthesis" "f"&nbsp;"close parenthesis" {</p>

<p>It builds properly in the PDF, but this seems weird. Is this normal? &nbsp;</p>
</div>
-->

<pre data-code-language="p5js" data-type="programlisting">
var films = [];
var filmData;

function preload() {
  filmData = loadJSON("films.json");
}

function setup() {
  createCanvas(480, 120);
  for (var i = 0; i &lt; filmData.length; i++) {
    var o = filmData[i];
    films[i] = new Film(o);
  }
  noStroke();
}

function draw() {
  background(0);
  for (var i = 0; i &lt; films.length; i++) {
    var x = i*32 + 32;
    films[i].display(x, 105);
  }
}

function Film(f) {
  this.title = f.title;
  this.director = f.director;
  this.year = f.year;
  this.rating = f.rating;

  this.display = function(x, y) {
    var ratingGray = map(this.rating, 6.5, 8.1, 102, 255);
    push();
    translate(x, y);
    rotate(-QUARTER_PI);
    fill(ratingGray);
    text(this.title, 0, 0);
    pop();
  };
}</pre>

<p>Este ejemplo es un esbozo de la visualizaci&#xf3;n de los datos de las pel&#xed;culas. Muestra c&#xf3;mo cargar los datos y c&#xf3;mo dibujar seg&#xfa;n los valores de los datos, pero queda como desaf&#xed;o tuyo darle un formato y acentuar lo que t&#xfa; encuentras m&#xe1;s interesante en los datos. Por ejemplo, &#xbf;es m&#xe1;s interesante mostrar el n&#xfa;mero de peliculas que Godard hizo cada a&#xf1;o? &#xbf;Es m&#xe1;s interesante comparar y contrastar estos datos con las pel&#xed;culas de otro director? &#xbf;Ser&#xe1; esto m&#xe1;s facil de leer con una tipograf&#xed;a distinta, con otro tama&#xf1;o del bosquejo o relaci&#xf3;n de aspecto? Las habilidades presentadas en los ejemplos anteriores de este libro pueden ser aplicadas para llevar este bosquejo al siguiente nivel de<a contenteditable="false" data-primary="JSON files" data-startref="jsonf12" data-type="indexterm">&nbsp;</a><a contenteditable="false" data-primary="data" data-secondary="JSON" data-startref="json12" data-type="indexterm">&nbsp;</a>refinamiento.</p>
</section>
</section>

<section data-type="sect1">
<h1>Datos de redes y APIs</h1>

<p>El acceso<a contenteditable="false" data-primary="data" data-secondary="network" data-see="APIs (application programming interfaces)" data-type="indexterm">&nbsp;</a><a contenteditable="false" data-primary="APIs (application programming interfaces)" data-type="indexterm" id="api12">&nbsp;</a><a contenteditable="false" data-primary="data" data-secondary="and APIs" data-type="indexterm" id="d12api">&nbsp;</a>p&#xFA;blico a cantidades gigantes de datos recolectados por gobiernos, corporaciones, organizaciones e individuos est&#xE1; cambiando nuestra cultura, desde la manera en que socializamos hasta c&#xF3;mo pensamos ideas intangibles como la privacidad. Estos datos son muy frecuentemente accesados a trav&#xE9;s de estructuras de software lllamadas <em>APIs</em>.</p>

<p>El acr&#xF3;nimo <em>API</em> es misterioso y su significado — interfaz de programaci&#xF3;n de aplicaciones — no es mucho m&#xE1;s clara. Sin embargo, las APIs son esenciales para trabajar con datos y no son necesariamente dif&#xED;ciles de entender. Esencialmente, son requerimientos de datos hechos a un servicio. Cuando los conjuntos de datos son enormes, no es pr&#xE1;ctico ni deseable copiar la totalidad de los datos. Una API le permite a un programador pedir solo el goteo de datos que es relevante dentro de este gran oc&#xE9;ano.</p>

<p>El concepto puede ser ilustrado de manera m&#xE1;s clara con un ejemplo hipot&#xE9;tico. Asumamos que existe una organizaci&#xF3;n que mantiene una base de datos de rangos de temperatura para cada ciudad dentro de un pa&#xED;s. La API para este conjunto de datos le permite a un programador pedir las temperaturas m&#xE1;xima y m&#xED;nimas de cualquier ciudad durante el mes de octubre del a&#xF1;o 1972. Para requerir estos datos, la petici&#xF3;n debe ser hecha mediante una l&#xED;nea o l&#xED;neas de c&#xF3;digo espec&#xED;ficas, en el formato requerido por el servicio de datos.&nbsp;</p>

<p>Algunas APIs son completamente p&#xFA;blicas, pero muchas requieren autentificaci&#xF3;n, que corresponde t&#xED;picamente a una identidad  de usuario (ID) o llave para que el servicio de datos pueda mantener registro de sus usuarios. La mayor&#xed;a de las APIs posee reglas sobre cu&#xE1;ntos y cu&#xE1;n frecuentemente se pueden hacer peticiones. Por ejemplo, puede ser posible hacer solamente 1.000 peticiones al mes, o no m&#xE1;s de una petici&#xF3;n por segundo.</p>

<div data-nickname="akaziuna" data-type="comment">
<p>PRODUCTION: I didn't put the URL below (http://api.openweathermap.org/data/2.5/find?q=Cincinnati&amp;units=imperial&nbsp;)in italics because it's an example that's meant to be read and "decoded". Ideally we can keep it from wrapping in print, so it's easy to read, but that's probably not possible.</p>
</div>

<p>p5.js puede solicitar datos a trav&#xe9;s de Internet cuando el computador est&#xE1; corriendo el programa en l&#xED;nea. Los archivos CSV, TSV, JSON y XML pueden ser cargados usando la funci&#xF3;n correspondiente de carga usando la URL como par&#xE1;metro. Por ejemplo, el clima actual en Cincinnati est&#xE1; disponible en formato JSON en esta URL: <a href="http://api.openweathermap.org/data/2.5/find?q=Cincinnati&amp;units=imperial"><em>http://api.openweathermap.org/data/2.5/find?q=Cincinnati&amp;units=imperial</em></a>.</p>

<p>Lee la URL detenidamente para decodificarla:</p>

<ol>
	<li>Pide datos al subdominio <em>api</em> del sitio <em>openweathermap.org</em>.</li>
	<li>Especifica una ciudad a buscar (<em>q</em> es una abreviaci&#xF3;n de <em>query</em> (b&#xFA;squeda), lo que es usado frecuentemente en URLs para especificar b&#xFA;squedas).</li>
	<li>Tambi&#xE9;n indica que los datos deben ser retornados en formato imperial, lo que significa que la temperatura estar&#xE1; en Fahrenheit. Reemplazando <em>imperial</em> por <em>metric</em> se obtendr&#xE1; la temperatura en grados Celsius.</li>
</ol>

<p>Revisar estos datos de OpenWeatherMap es un ejemplo m&#xE1;s realista de trabajo con datos encontrados que los conjuntos anteriores de datos simplificados. Al momento de escribir, el archivo retornado por la URL es el siguiente:</p>

<pre>
{"message":"accurate","cod":"200","count":1,"list":[{"id":<br />4508722,"name":"Cincinnati","coord":{"lon":-84.456886,"lat":<br />39.161999},"main":{"temp":34.16,"temp_min":34.16,"temp_max":<br />34.16,"pressure":999.98,"sea_level":1028.34,"grnd_level":<br />999.98,"humidity":77},"dt":1423501526,"wind":{"speed":<br />9.48,"deg":354.002},"sys":{"country":"US"},"clouds":{"all":<br />80},"weather":[{"id":803,"main":"Clouds","description":<br />"broken clouds","icon":"04d"}]}]}
</pre>

<p>Este archivo es mucho m&#xE1;s f&#xE1;cil de leer cuando es retornado con saltos de l&#xED;nea, y cuando el objeto JSON y las estructuras del arreglo est&#xE1;n definidas con llaves y corchetes:</p>

<pre data-code-language="json" data-type="programlisting">
{
  "message": "accurate",
  "count": 1,
  "cod": "200",
  "list": [{
    "clouds": {"all": 80},
    "dt": 1423501526,
    "coord": {
      "lon": -84.456886,
      "lat": 39.161999
    },
    "id": 4508722,
    "wind": {
      "speed": 9.48,
      "deg": 354.002
    },
    "sys": {"country": "US"},
    "name": "Cincinnati",
    "weather": [{
      "id": 803,
      "icon": "04d",
      "description": "broken clouds",
      "main": "Clouds"
    }],
    "main": {
      "humidity": 77,
      "pressure": 999.98,
      "temp_max": 34.16,
      "sea_level": 1028.34,
      "temp_min": 34.16,
      "temp": 34.16,
      "grnd_level": 999.98
    }
  }]
}</pre>

<p>Observa que los corchetes en las secciones de <code>"list"</code> y <code>"weather"</code>, indican un arreglo de objetos JSON. Aunque el arreglo en este ejemplo solamente contiene un &#xED;tem, en otros casos, la API podr&#xED;a retornar varios d&#xED;as o varaciones de m&#xFA;ltiples estaciones metereol&#xF3;igicas.</p>

<section data-type="sect2" id="ex-12-6">
<h2>Ejemplo 12-6: procesando la informaci&#xF3;n del clima</h2>

<p>El primer paso cuando se trabaja con estos datos es estudiarlos y luego escribir un poco de c&#xF3;digo para extraer los datos deseados. En este caso, queremos saber la temperatura actual. Podemos ver que nuestro dato de temperatura es 34.16. Est&#xE1; etiquetado como <code>temp</code> y est&#xE1; dentro del objeto <code>main</code>,que est&#xE1; adentro del arreglo <code>list</code>. Una funci&#xF3;n llamada <code>getTemp()</code> fue escrita espec&#xED;ficamente para que este c&#xF3;digo funcione con el formato de esta organizaci&#xF3;n de archivos JSON espec&#xed;fica:</p>

<pre data-code-language="p5js" data-type="programlisting">
var weatherData;

function preload() {
  weatherData = loadJSON("cincinnati.json");
}

function setup() {
  var temp = getTemp(weatherData);
  print(temp);
}

function getTemp(data) {
  var list = data.list;
  var item = list[0];
  var main = item.main;
  var t = main.temp;
  return t;
}</pre>

<p>Los datos del archivo JSON son cargados en <code>preload()</code> y son pasados a la funci&#xF3;n <code>getTemp()</code> dentro de <code>setup()</code>. Luego, por el formato del archivo JSON, una serie de variables es usada para ir m&#xE1;s y m&#xE1;s profundo dentro de la estructura de los datos para finalmente llegar al n&#xFA;mero que deseamos. Este n&#xFA;mero es almacenado en la variable <span class="keep-together"><code>temperature</code></span> y luego es retornada por la funci&#xF3;n para ser asignada a la variable <code>temp</code> en <code>setup()</code> donde es impresa en la consola.</p>
</section>

<section data-type="sect2" class="pagebreak-before">
<h2>Ejemplo 12-7: concatenando m&#xE9;todos</h2>

<p>La<a contenteditable="false" data-primary="data" data-secondary="chaining methods" data-type="indexterm">&nbsp;</a><a contenteditable="false" data-primary="chaining methods" data-type="indexterm">&nbsp;</a> secuencia de variables JSON creada en sucesi&#xF3;n en el ejemplo anterior puede ser realizada de ujna forma distinta concatenando accesores. Este ejemplo funciona como el<a data-type="xref" href="#ex-12-6">#ex-12-6</a>, pero los m&#xE9;todos est&#xe1;n conectadas con el operador punto, en vez de ser calculados uno a la vez y asignados a variables intermedias:</p>

<pre data-code-language="p5js" data-type="programlisting">
var weatherData;

function preload() {
  weatherData = loadJSON("cincinnati.json");
}

function setup() {
  var temp = getTemp(weatherData);
  print(temp);
}

function getTemp(data) {
  return data.list[0].main.temp;
}</pre>

<p>Adem&#xE1;s observa c&#xF3;mo la temperatura final es retornada por la funci&#xF3;n <code>getTemp()</code>. En el <a data-type="xref" href="#ex-12-6">#ex-12-6</a>, se crea una variable para almacenar el valor y luego ese valor es retornado. Aqu&#xED;, el valor de la temperatura es retornado directamente, sin una variable intermedia.</p>

<p>Este ejemplo puede ser modificado para acceder a m&#xE1;s datos de la organizaci&#xF3;n y para construir un bosquejo que muestre los datos en la pantalla en vez de solamente escribirlos en la consola. Tambi&#xE9;n puedes modificarlo para que lea datos de otra API - te encontrar&#xE1;s con que los datos retornados por muchas APIs comparten un formato<a contenteditable="false" data-primary="APIs (application programming interfaces)" data-startref="api12" data-type="indexterm">&nbsp;</a><a contenteditable="false" data-primary="data" data-secondary="and APIs" data-startref="d12api" data-type="indexterm">&nbsp;</a>similar.</p>
</section>
</section>

<section data-type="sect1">
<h1>Robot 10: datos</h1>

<figure><img alt="Robot 10" src="images/gspj_12in05.png" />
<figcaption/>
</figure>

<p>El ejemplo final<a contenteditable="false" data-primary="robot programs (examples)" data-secondary="generating and reading data files" data-type="indexterm" id="rp12grdf">&nbsp;</a> de robot en este libro es diferente del resto porque tiene dos partes. La primera parte genera un archivo usando valores aleatorios y bucles <code>for</code> y la segunda parte lee ese archivo de datos para dibujar un ej&#xE9;rcito de robots en la pantalla.</p>

<p>El primer bosquejo usa dos nuevos elementos de c&#xF3;digo, la clase <code>PrintWriter</code> <a contenteditable="false" data-primary="PrintWriter class" data-type="indexterm">&nbsp;</a>y la funci&#xF3;n <code>createWriter()</code> <a contenteditable="false" data-primary="createWriter() function" data-type="indexterm">&nbsp;</a>. Usadas en conjunto, crean y abren un archivo en el directorio del bosquejo para almacenar los datos generados por el bosquejo. En este ejemplo, el objeto creado con <code>PrintWriter</code> es llamado <code>output</code> y el archivo es llamado <em>botArmy.tsv</em>. En los bucles, los datos son escritos en el archivo al ejecutar el m&#xE9;todo <code>println() </code> en el objeto de salida. Aqu&#xED;, los valores aleatorios son usados para definir cu&#xE1;l de las tres im&#xE1;genes del robot ser&#xE1;n dibujadas por cada coordenada. Para que el archivo se cree correctamente, el m&#xE9;todo <code>close()</code>  debe ser ejecutado antes de que el programa se detenga. El c&#xF3;digo que dibuja una elipse es un adelanto visual para revelar la posici&#xF3;n de la coordenada en la pantalla, pero observa que la elipse no est&#xE1; grabada en el archivo:</p>

<pre data-code-language="p5js" data-type="programlisting">
var output;

function setup() {
  createCanvas(720, 480);
  // Crea el archivo nuevo
  output = createWriter("botArmy.tsv");
  // Escribe una l&#xED;nea de encabezado con los t&#xED;tulos de las columnas
  output.println("type\tx\ty");
  for (var y = 0; y &lt;= height; y += 60) {
    for (var x = 0; x &lt;= width; x += 20) {
      var robotType = int(random(1, 4));
      output.println(robotType + "\t" + x + "\t" + y);
      ellipse(x, y, 12, 12);
    }
  }
  output.close();  // Cierra el archivo
}
</pre>

<p>Despu&#xE9;s que el programa es ejecutado, el archivo <em>botArmy.tsv</em> es creado dentro el directorio del <em>bosquejo</em>. &#xC1;brelo para revisar c&#xF3;mo se escribieron los datos. Las primeras cinco l&#xED;neas de c&#xF3;digo de este archivo ser&#xE1;n similares a esto:</p>

<pre data-type="programlisting">
type&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;x	 y
3	 0	 0
1	 20	0
2	 40	0
1	 60	0
3	 80	0
</pre>

<p>La primera columna es usada para definir qu&#xe9; imagen de robot se va a usar, la segunda columna es la coordenada <em>x</em>, y la tercera columna es la coordenada <em>y</em>. El siguiente bosquejo carga este archivo <em>botArmy.tsv</em> y usa los datos para estos prop&#xF3;sitos:</p>

<pre data-code-language="p5js" data-type="programlisting">
var robots;
var bot1;
var bot2;
var bot3;

function preload() {
  bot1 = loadImage("robot1.png");
  bot2 = loadImage("robot2.png");
  bot3 = loadImage("robot3.png");
  robots = loadTable("botArmy.tsv", "header");
}

function setup() {
  createCanvas(720, 480);
  imageMode(CENTER);
  for (var i = 0; i &lt; robots.getRowCount(); i++) {
    var bot = robots.getNum(i, "type");
    var x = robots.getNum(i, "x");
    var y = robots.getNum(i, "y");
    var sc = 0.15;
    if (bot == 1) {
      image(bot1, x, y, bot1.width*sc, bot1.height*sc);
    } else if (bot == 2) {
      image(bot2, x, y, bot2.width*sc, bot2.height*sc);
    } else {
      image(bot3, x, y, bot3.width*sc, bot3.height*sc);
    }
  }
}
</pre>

<p>Una variaci&#xF3;n m&#xE1;s concisa (y flexible) de este bosquejo usa arreglos como un enfoque m&#xE1;s avanzado:</p>

<pre data-code-language="p5js" data-type="programlisting">
var numRobotTypes = 3;
var images = [];
var scaling = 0.15;
var botArmy;

function preload() {
  for (var i = 0; i &lt; numRobotTypes; i++) {
    images[i] = loadImage("robot" + (i+1) + ".png");
  }
  botArmy = loadTable("botArmy.tsv", "header");
}

function setup() {
  createCanvas(720, 480);
  imageMode(CENTER);
  for (var i = 0; i &lt; botArmy.getRowCount(); i++) {
    var robotType = botArmy.getNum(i, "type");
    var x = botArmy.getNum(i, "x");
    var y = botArmy.getNum(i, "y");
    var bot = images[robotType - 1];
    image(bot, x, y, bot.width*scaling, bot.height*scaling);
  }
}</pre>
<a contenteditable="false" data-primary="data" data-startref="d12" data-type="indexterm"></a><a contenteditable="false" data-primary="robot programs (examples)" data-secondary="generating and reading data files" data-startref="rp12grdf" data-type="indexterm"></a>


</section>
</section>
<!--End chapter-->
